docs: reword request lifecycle diagrams to mermaid
Signed-off-by: Justin Chadwell <me@jedevc.com>
